#من این پروژه رو به سه قسمت تقسیم میکنم 
# قسمت اول : اینکهاز کاربر ورودی و تسکی رو که می خواد بگیره و اون تسک هر تعداد بود بگیره و در داخل یک لیست اضافه کنه و اون فایل تکست رو ذخیره که و این سوال پرسیدن ازکاربر باید ادامه داشته باشه تا کاربر در قسمت ورودی که فینیش را وارد کند
# قسمت دوم:وقتی کاربر دوباره پروژه را باز میکنه و اسم کاری رو وارد میکنه پروژه باید اون فایل تکست باز کنه و درداخل اون بگیره بگرده واگر ورودی کاربر در فایل وجود داشته باشه به کاربر علامت بده و بعد اون رو اصلاح بکنهو
# قسمت سوم : اگر کاربر اون تسک را انجام داد و اون وارد کرد و دو تا علامت ++ زد جلوی اون کلمه باید اون کار در داخل لیست حذف بشه یا روش خط بخوره 
def MyList():
    Taskmanager=[]
    return Taskmanager
def InputUser(Taskmanager):
    UserInput=input("what is task")
    Taskmanager.append(UserInput)
    print (Taskmanager)    
Taskmanager=MyList()
InputUser(Taskmanager)
    
